Revit 2027 API
RebarConstraintsManager.GetRebar Method
 Gets the Rebar element whose constraints are managed using this instance.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Rebar GetRebar()
Public Function GetRebar As Rebar
public:
Rebar^ GetRebar()
member GetRebar : unit -> Rebar
Return Value
Rebar
 Returns the Rebar element whose constraints are managed using this instance.
See Also
Reference
RebarConstraintsManager Class
Autodesk.Revit.DB.Structure Namespace